{"Cluster 0": {"name": "Affluent Water Enthusiasts", "description": "This cluster comprises predominantly middle-aged to older males with higher education levels who favor water-related activities and environments. They are most likely to enjoy spending time by lakes or beaches, with a strong preference for dogs, especially in water settings."}, "Cluster 1": {"name": "Mountain-Loving Senior Dog Lovers", "description": "This group mainly consists of older adults, primarily males with higher education, who are passionate about mountains and prefer spending time in mountainous areas. They favor dogs, especially in outdoor mountain environments, indicating an active, nature-oriented lifestyle."}, "Cluster 2": {"name": "Young Urban Dog Aficionados", "description": "This cluster includes younger adults, mostly males with higher education, who have a diverse preference for cats and dogs. They enjoy mountain activities and are likely to be active, urban dwellers with a fondness for outdoor adventures in mountainous regions."}, "Cluster 3": {"name": "Middle-Aged Forest and Dog Enthusiasts", "description": "This group is characterized by middle-aged individuals, predominantly males with higher education, who favor forest environments and enjoy dogs, especially dogs and other animals. They are likely nature lovers who spend time in wooded areas."}, "Cluster 4": {"name": "Diverse Nature and Animal Admirers", "description": "This cluster features middle-aged adults with a balanced gender distribution, who enjoy a variety of animals including cats and dogs, and prefer mountain and forest settings. They have a moderate interest in outdoor activities and nature."}, "Cluster 5": {"name": "Young Water-Adjacent Casuals", "description": "This group consists of younger individuals, with a slight female majority, who are less educated and have no specific favorite animals. They prefer water-related environments and are likely casual outdoor enthusiasts."}, "Cluster 6": {"name": "Older Water and Animal Enthusiasts", "description": "This cluster includes middle-aged to older males and females with higher education levels, who enjoy water activities and have a fondness for dogs and cats. They are likely to spend leisure time near water bodies and appreciate a variety of animals."}, "Cluster 7": {"name": "Active Mountain and Water Lovers", "description": "This group is composed mainly of middle-aged adults, predominantly males, who enjoy outdoor activities in mountains and near water. They favor dogs and are active outdoor enthusiasts with a preference for water-based recreation."}}